{
    "all_projects": "Alle Projekte",
    "react_nextjs": "React & NextJS",
    "javascript": "JavaScript",
    "html_css": "HTML & CSS",
    "technologies_title": "Technologien: ",
    "live_demo": "Live-Demo",
    "github": "GitHub",
    "show_more": "Mehr anzeigen",
    "show_less": "Weniger anzeigen",
    "portfolio_project_title": "My Portfolio",
    "portfolio_project_subtitle": "Eine moderne, responsive Portfolio-Webseite mit ReactJS, bereitgestellt auf Netlify, mit Lokalisierung, Dark/Light-Modus und mehr.",
    "portfolio_project_features": [
      "Lokalisierung: En, De",
      "Responsives Design: Funktioniert perfekt auf allen Geräten.",
      "Sanftes Scrollen: Einfache Navigation mit sanftem Scrollverhalten.",
      "Scroll-zum-Anfang-Button: Scrollt automatisch zurück nach oben.",
      "Projektfilter: Dynamisches Filtern der Projekte nach Kategorie (CSS, JavaScript, React, usw.).",
      "Framer Motion Animationen: Interaktive Animationen in den Projektabschnitten.",
      "Kontaktformular: Integriert mit Formspree für einfache Formularübermittlung.",
      "Bereitgestellt mit Netlify für schnelles und zuverlässiges Hosting."
    ],
    "portfolio_project_description": "Dies ist meine persönliche Portfolio-Webseite, erstellt mit ReactJS und bereitgestellt über Netlify. Sie zeigt meine Projekte, Fähigkeiten und Erfahrungen in einem modernen, responsiven Design.",
    "crud_project_title": "CRUDS",
    "crud_project_subtitle": "Ein einfaches Produktverwaltungssystem, das es Benutzern ermöglicht, Produkte zu verwalten.",
    "crud_project_features": [
      "Neue Produkte hinzufügen: Fügen Sie mehrere Produkte mit Details hinzu.",
      "Gesamtpreis berechnen: Berechnet den Gesamtpreis dynamisch.",
      "Produkte aktualisieren/löschen: Produkte einfach aktualisieren und löschen.",
      "Suchfunktion: Produkte nach Titel oder Kategorie suchen.",
      "Daten im lokalen Speicher speichern: Daten bleiben auch nach dem Aktualisieren der Seite erhalten.",
      "Responsives Design: Eine responsive Benutzeroberfläche mit HTML und CSS."
    ],
    "crud_project_description": "Ein einfaches Produktverwaltungssystem, das es Benutzern ermöglicht, Produkte hinzuzufügen, zu aktualisieren, zu löschen und zu durchsuchen – mit dauerhafter Speicherung.",
    "ecommerce_project_title": "E-Commerce-Website",
    "ecommerce_project_subtitle": "Online-Shop mit einer großen Auswahl an Produkten, von Elektronik bis Mode, mit tollen Angeboten und Rabatten.",
    "ecommerce_project_features": [
      "Benutzerfreundliche Oberfläche für einfache Navigation.",
      "Suchfunktion, um Produkte schnell zu finden.",
      "Warenkorb zur Verwaltung ausgewählter Artikel.",
      "Responsives Design für mobile und Desktop-Kompatibilität."
    ],
    "ecommerce_project_description": "Ein Online-Shop mit einer großen Auswahl an Produkten, benutzerfreundlicher Oberfläche, Suchfunktion und Warenkorb."
  }
  