{
    "projects_title": "",
    "all_projects": "All projects",
    "react_nextjs": "React & NextJS",
    "javascript": "JavaScript",
    "html_css": "HTML & CSS",
    "technologies_title": "Technologies: ",
    "live_demo": "Live Demo",
    "github": "GitHub",
    "show_more": "Show More",
    "show_less": "Show Less",
    "portfolio_project_title": "My Portfolio",
    "portfolio_project_subtitle": "A modern, responsive portfolio website built with ReactJS, deployed on Netlify, featuring localization, dark/light mode, and more.",
    "portfolio_project_features": [
      "Localization: En, De",
      "Responsive Design: Works perfectly across all devices.",
      "Smooth Scrolling: Easy navigation with smooth scroll behavior.",
      "Scroll to Top Button: Automatically scrolls the user back to the top.",
      "Project Filter: Dynamic project filtering by category (CSS, JavaScript, React, etc.).",
      "Framer Motion Animations: Interactive animations included in the project sections.",
      "Contact Form: Integrated with Formspree for easy form submissions.",
      "Deployed with Netlify for fast and reliable hosting."
    ],
    "portfolio_project_description": "This is my personal portfolio website, built with ReactJS and deployed using Netlify. It showcases my projects, skills, and experience with a modern, responsive design and advanced features.",
    "ecommerce_project_title": "E-Commerce Website",
    "ecommerce_project_subtitle": "A modern online store with comprehensive product catalog, user authentication, and built-in product comparison features.",
    "ecommerce_project_description": "A full-featured E-Commerce platform that offers a wide variety of products with advanced features including product comparison, search functionality, user authentication, and a responsive design for optimal shopping experience.",
    "ecommerce_project_features": [
      "Home: User-friendly landing page with featured products and promotions",
      "Shop: Browse and search through extensive product catalog with filters",
      "Compare: Built-in product comparison tool to compare features and prices",
      "Search: Advanced search functionality with category and price filters",
      "Log In: User authentication and personalized shopping experience",
      "Shopping Cart: Add, remove, and manage items in cart",
      "Responsive Design: Works perfectly on all devices and screen sizes",
      "Deployed on Netlify for fast and reliable hosting"
    ],
    "crypto_project_title": "Crypto Tracker",
    "crypto_project_subtitle": "A modern cryptocurrency tracking app built with React, Firebase, and Tailwind CSS.",
    "crypto_project_description": "A comprehensive cryptocurrency tracking application that provides real-time information about various cryptocurrencies, including prices, trends, and charts. Features user authentication and theme customization.",
    "crypto_project_features": [
      "Real-time cryptocurrency price tracking",
      "User Authentication with Firebase",
      "Dark/Light mode toggle with theme persistence",
      "Responsive design for all device sizes",
      "Interactive price charts and trends",
      "Mobile-friendly navigation",
      "Secure routing with Firebase authentication",
      "Deployed on Firebase hosting"
    ],
    "crud_project_title": "CRUDS",
    "crud_project_subtitle": "A simple Product Management System that allows users to manage products.",
    "crud_project_features": [
      "Add New Products: Add multiple products with details.",
      "Calculate Total Price: Calculate the total price dynamically.",
      "Update/Delete Products: Easily update and delete products.",
      "Search Functionality: Search products by title or category.",
      "Store Data in Local Storage: Data persists even after refreshing the page.",
      "Responsive Design: A responsive UI built using HTML and CSS."
    ],
    "crud_project_description": "A simple Product Management System that allows users to add, update, delete, and search products with persistent storage."
  }
  